package Lesson2;

public class Lesson2task10 {
    public static void main(String[] args) {
        int familyIncome = 30000;
        if (familyIncome <= 50000 && familyIncome >= 20000) {
            System.out.println("True");
        }
    }
}
/*10. Получение ипотеки
        Имеем переменную - доход семьи
        Написать boolean - который возвращает true, если доход меньше 50000 и больше
        20000*/
