package Lesson2;

public class Lesson2task11 {
    public static void main(String[] args) {
        int appleSort1 = 5;
        int appleSort2 = 10;
        if (appleSort1 > 0 || appleSort2 > 0) {
            System.out.println("True");
        }
    }
}
/*11. Закупка
        Имеем 2 переменные - первая - наличие в магазине яблок сорта 1 вторая - наличие в
        магазине яблок сорта 2
        Написать boolean - который возвращает true, если есть в наличии хотя бы один сорт*/