package Lesson3;

public class Task5 {
    public static void main(String[] args) {
        int y = 15;
        int x = 7;
        if (x > y) {
            System.out.println("The number x has the greatest value");
        } else {
            System.out.println("The number y has the greatest value");
        }
    }
}
/*5.Написать программу, которая сравнивает два числа типа int и определяет, какое из
чисел большее, а какое меньшее. Программа должна вывести что-то типа “The number
x has the greatest value”. Где “x” одно из чисел*/
