package Lesson4;
import java.util.Arrays;
public class Task1 {
     public static void main(String[] args) {
        int[] numbers = {9, 10, 3, 4, 5};
        Arrays.sort(numbers);
        System.out.println(numbers[0]);
        }
    }
//another way

/*1. Написать программу, которая находит минимальное значение в массиве*/