public class Lesson2task11 {
    public static void main(String[] args){
        int apple_sort1=5;
        int apple_sort2=10;
        if (apple_sort1>0||apple_sort2>0){
            System.out.println("True");
        }
    }
}
/*11. Закупка
        Имеем 2 переменные - первая - наличие в магазине яблок сорта 1 вторая - наличие в
        магазине яблок сорта 2
        Написать boolean - который возвращает true, если есть в наличии хотя бы один сорт*/