public class Lesson2task10 {
    public static void main(String[] args){
        int family_income = 30000;
        if (family_income<=50000 && family_income>=20000){
        System.out.println("True");
        }
    }
}
/*10. Получение ипотеки
        Имеем переменную - доход семьи
        Написать boolean - который возвращает true, если доход меньше 50000 и больше
        20000*/
