public class Lesson2task9 {
    public static void main(String[] args) {
        int husband_age = 34;
        int wife_age = 32;
        if (husband_age >= 35 && wife_age >= 35){
            System.out.println("False");
        }
        else{System.out.println("True");
        }
    }
}
/*9. Получение ипотеки
        Имеем 2 переменные - возраст мужа и жены
        Написать boolean - который возвращает true, если им обоим менее 35 лет (логические
        выражения и операторы сравнения), если кому то больше, то false*/